# Python Package : Pandas  --> In Progress

In [1]:
#Importing Packages
import numpy as np
import pandas as pd
import os

In [2]:
#identifying the current working directory
os.getcwd()

'C:\\Users\\Darshan Sreenath\\Python_Learning'

#### Pandas Seies

#### More about pandas series here 
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html?highlight=series#pandas.Series <b>

https://www.youtube.com/watch?v=UB3DE5Bgfx4

In [3]:
#creating a pandas serires
pds = pd.Series([1,2,3,4,5,6])
print(type(pds))
pds

<class 'pandas.core.series.Series'>

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [4]:
#creating a pandas serires
pds_1 = pd.Series([1,2,3,4,5,6,np.nan])
pds_1

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    NaN
dtype: float64

In [5]:
#retriving the index of the serires,
print(pds_1.index)

#iloc used to select an element based on its location
print("2nd Index Location using iloc ",pds_1.iloc[2])

#alternate option
print("2nd Index Location ",pds_1[2])

#shape of the series
print("Shape of the series ",pds_1.shape)

#size of the series
print("Size of the series ",pds_1.size)

print("printing first 3 elements of pds_1")
pds_1[0:3]

RangeIndex(start=0, stop=7, step=1)
2nd Index Location using iloc  3.0
2nd Index Location  3.0
Shape of the series  (7,)
Size of the series  7
printing first 3 elements of pds_1

0    1.0
1    2.0
2    3.0
dtype: float64

#### Date Range

In [6]:
pd_dates_0 = pd.date_range('20200620',periods=15) 
pd_dates_0

DatetimeIndex(['2020-06-20', '2020-06-21', '2020-06-22', '2020-06-23',
               '2020-06-24', '2020-06-25', '2020-06-26', '2020-06-27',
               '2020-06-28', '2020-06-29', '2020-06-30', '2020-07-01',
               '2020-07-02', '2020-07-03', '2020-07-04'],
              dtype='datetime64[ns]', freq='D')

In [7]:
#creating a datarange, here the starting date is given and how many sequence more is required. (periods=7)
pd_dates = pd.date_range('20200617',periods=15, freq='W-MON') 
pd_dates

DatetimeIndex(['2020-06-22', '2020-06-29', '2020-07-06', '2020-07-13',
               '2020-07-20', '2020-07-27', '2020-08-03', '2020-08-10',
               '2020-08-17', '2020-08-24', '2020-08-31', '2020-09-07',
               '2020-09-14', '2020-09-21', '2020-09-28'],
              dtype='datetime64[ns]', freq='W-MON')

More about this command and its optional functions <br>
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.date_range.html <br>
https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#timeseries-offset-aliases

In [8]:
df1 =pd.DataFrame(np.random.randn(15,4),index=pd_dates,columns=["A","B","C","D"])
df2 =pd.DataFrame(np.random.randint(1,45,size=(15,4)),index=pd_dates,columns=["A","B","C","D"])

print(df1)
print("\n")
print(df2)

                   A         B         C         D
2020-06-22  0.521826 -0.999455  0.432607  0.993062
2020-06-29  3.023598 -0.598091  0.194947  0.530921
2020-07-06 -0.872198 -2.112685 -0.684992 -0.677001
2020-07-13  0.694188 -1.215368 -0.137225 -0.023338
2020-07-20  0.542785 -0.339277  2.089011  0.750586
2020-07-27 -1.174103 -1.030683  0.710252 -0.055286
2020-08-03  0.330551 -1.498275  0.488792 -0.884653
2020-08-10 -0.853994 -0.283391 -0.179801  1.369394
2020-08-17  0.453002  0.828775 -0.895610 -0.012188
2020-08-24 -1.430980 -0.092620 -0.114235  0.708847
2020-08-31 -0.848979 -0.847830  0.483344 -1.224947
2020-09-07  0.458162 -0.405920 -0.539044 -0.437574
2020-09-14 -1.256464 -0.045130  0.602257 -0.106910
2020-09-21  0.646547  1.933659  0.106685 -0.273700
2020-09-28  0.108463 -2.639488  2.209422  0.592224


             A   B   C   D
2020-06-22   6  42   9  35
2020-06-29  32  12  30  36
2020-07-06  10  16  30  15
2020-07-13   8  32  20  36
2020-07-20  37   3   3  19
2020-07-27  44   5  23  30
2020-08-03  21   7   5  21
2020-08-10  43   6  33  17
2020-08-17  31  25   1  34
2020-08-24   5  29   4   7
2020-08-31   1  15  30   1
2020-09-07  13   2  25  25
2020-09-14   3  43   1  32
2020-09-21  12  12  23  21
2020-09-28   4  16  16  41

In [9]:
#Creating a data frame from a dictionary
df3 = pd.DataFrame({ 'A' : [1,2,3,4],
                      'B' : pd.Timestamp('20200618'),
                      'C' : pd.Series(1,index=list(range(4)),dtype="float32"),
                      'D' : np.array([5]*4,dtype='int32'),
                      'E' : pd.Categorical(['True','False','True','True']),
                      'F' : 'Pandas'})

df3

   A          B    C  D      E       F
0  1 2020-06-18  1.0  5   True  Pandas
1  2 2020-06-18  1.0  5  False  Pandas
2  3 2020-06-18  1.0  5   True  Pandas
3  4 2020-06-18  1.0  5   True  Pandas

In [10]:
#Understanding the datatypes of columns in the dataframe
df3.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [11]:
#converting a dataframe to a numpy array
df3.to_numpy()

array([[1, Timestamp('2020-06-18 00:00:00'), 1.0, 5, 'True', 'Pandas'],
       [2, Timestamp('2020-06-18 00:00:00'), 1.0, 5, 'False', 'Pandas'],
       [3, Timestamp('2020-06-18 00:00:00'), 1.0, 5, 'True', 'Pandas'],
       [4, Timestamp('2020-06-18 00:00:00'), 1.0, 5, 'True', 'Pandas']],
      dtype=object)

In [12]:
#printing first 3 elements of the dataframe. if no value specified, it'll take the default value of 5
df1.head(3)

                   A         B         C         D
2020-06-22  0.521826 -0.999455  0.432607  0.993062
2020-06-29  3.023598 -0.598091  0.194947  0.530921
2020-07-06 -0.872198 -2.112685 -0.684992 -0.677001

In [13]:
#peinitng the last 5 rows of the data frame
df1.tail()

                   A         B         C         D
2020-08-31 -0.848979 -0.847830  0.483344 -1.224947
2020-09-07  0.458162 -0.405920 -0.539044 -0.437574
2020-09-14 -1.256464 -0.045130  0.602257 -0.106910
2020-09-21  0.646547  1.933659  0.106685 -0.273700
2020-09-28  0.108463 -2.639488  2.209422  0.592224

In [14]:
#printing the index values of the data frame.
df1.index

DatetimeIndex(['2020-06-22', '2020-06-29', '2020-07-06', '2020-07-13',
               '2020-07-20', '2020-07-27', '2020-08-03', '2020-08-10',
               '2020-08-17', '2020-08-24', '2020-08-31', '2020-09-07',
               '2020-09-14', '2020-09-21', '2020-09-28'],
              dtype='datetime64[ns]', freq='W-MON')

In [15]:
#Prints column names
df1.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
##general info about the dataframe
df1.describe()

               A          B          C          D
count  15.000000  15.000000  15.000000  15.000000
mean    0.022827  -0.623052   0.317761   0.083296
std     1.144959   1.110464   0.883713   0.730889
min    -1.430980  -2.639488  -0.895610  -1.224947
25%    -0.863096  -1.123026  -0.158513  -0.355637
50%     0.330551  -0.598091   0.194947  -0.023338
75%     0.532306  -0.188006   0.545525   0.650535
max     3.023598   1.933659   2.209422   1.369394

In [17]:
#sorting the data frame, uncomment one and see the output.

#df1.sort_values('C',ascending=True)
#df1.sort_values('C',ascending=False)
#df1.sort_index(axis=0,ascending=False)  ### sorting on the basis of index.
df1.sort_index(axis=0,ascending=True).head()

                   A         B         C         D
2020-06-22  0.521826 -0.999455  0.432607  0.993062
2020-06-29  3.023598 -0.598091  0.194947  0.530921
2020-07-06 -0.872198 -2.112685 -0.684992 -0.677001
2020-07-13  0.694188 -1.215368 -0.137225 -0.023338
2020-07-20  0.542785 -0.339277  2.089011  0.750586

In [18]:
#printing only the first column
df1['A'].head()

2020-06-22    0.521826
2020-06-29    3.023598
2020-07-06   -0.872198
2020-07-13    0.694188
2020-07-20    0.542785
Freq: W-MON, Name: A, dtype: float64

In [19]:
#printing the first and the third column
df1[['A','C']].head()

                   A         C
2020-06-22  0.521826  0.432607
2020-06-29  3.023598  0.194947
2020-07-06 -0.872198 -0.684992
2020-07-13  0.694188 -0.137225
2020-07-20  0.542785  2.089011

In [20]:
#printing the first to the third rows
df1[0:3]

                   A         B         C         D
2020-06-22  0.521826 -0.999455  0.432607  0.993062
2020-06-29  3.023598 -0.598091  0.194947  0.530921
2020-07-06 -0.872198 -2.112685 -0.684992 -0.677001

In [21]:
#loc function is used when we know col names
df1.loc[:,['A','C']].head()

                   A         C
2020-06-22  0.521826  0.432607
2020-06-29  3.023598  0.194947
2020-07-06 -0.872198 -0.684992
2020-07-13  0.694188 -0.137225
2020-07-20  0.542785  2.089011

In [22]:
#iloc function used when we know the col numer postions
df1.iloc[0:7,0:3]

                   A         B         C
2020-06-22  0.521826 -0.999455  0.432607
2020-06-29  3.023598 -0.598091  0.194947
2020-07-06 -0.872198 -2.112685 -0.684992
2020-07-13  0.694188 -1.215368 -0.137225
2020-07-20  0.542785 -0.339277  2.089011
2020-07-27 -1.174103 -1.030683  0.710252
2020-08-03  0.330551 -1.498275  0.488792

In [23]:
## the first function is printing the value for the rows which satisfies the conditions
print(df1['A'] > 1.2)

##this command uses the above argument as a filter
df1[df1['A'] > 0.8]

2020-06-22    False
2020-06-29     True
2020-07-06    False
2020-07-13    False
2020-07-20    False
2020-07-27    False
2020-08-03    False
2020-08-10    False
2020-08-17    False
2020-08-24    False
2020-08-31    False
2020-09-07    False
2020-09-14    False
2020-09-21    False
2020-09-28    False
Freq: W-MON, Name: A, dtype: bool

                   A         B         C         D
2020-06-29  3.023598 -0.598091  0.194947  0.530921

##### Handiling Missing Data

In [24]:
#printing first 3 values to see
df1.head(3)

                   A         B         C         D
2020-06-22  0.521826 -0.999455  0.432607  0.993062
2020-06-29  3.023598 -0.598091  0.194947  0.530921
2020-07-06 -0.872198 -2.112685 -0.684992 -0.677001

In [25]:
#viewing the index of the data frame df1
df1.index

DatetimeIndex(['2020-06-22', '2020-06-29', '2020-07-06', '2020-07-13',
               '2020-07-20', '2020-07-27', '2020-08-03', '2020-08-10',
               '2020-08-17', '2020-08-24', '2020-08-31', '2020-09-07',
               '2020-09-14', '2020-09-21', '2020-09-28'],
              dtype='datetime64[ns]', freq='W-MON')

In [26]:
#assigning the index values of df1 to D
d=df1.index

#creatning a dataframe df_4, there are two menthods mentioned belwo
df_4 = df1.reindex(index=d[0:4],columns=list(df1.columns)+['E'])  ## reindex similar to set subset

#alternate method below
#df_4 = df1.reindex(index=df1.index[0:4],columns=list(df1.columns)+['E'])

#printing the dataframe
df_4

                   A         B         C         D   E
2020-06-22  0.521826 -0.999455  0.432607  0.993062 NaN
2020-06-29  3.023598 -0.598091  0.194947  0.530921 NaN
2020-07-06 -0.872198 -2.112685 -0.684992 -0.677001 NaN
2020-07-13  0.694188 -1.215368 -0.137225 -0.023338 NaN

In [27]:
#allocating values to the nan columns
df_4.iloc[0,4]=0.7
df_4.iloc[1,4]=1.6

#printing 
df_4

                   A         B         C         D    E
2020-06-22  0.521826 -0.999455  0.432607  0.993062  0.7
2020-06-29  3.023598 -0.598091  0.194947  0.530921  1.6
2020-07-06 -0.872198 -2.112685 -0.684992 -0.677001  NaN
2020-07-13  0.694188 -1.215368 -0.137225 -0.023338  NaN

In [28]:
#checking for the presense of nan
df_4.isnull()

                A      B      C      D      E
2020-06-22  False  False  False  False  False
2020-06-29  False  False  False  False  False
2020-07-06  False  False  False  False   True
2020-07-13  False  False  False  False   True

In [29]:
#counting the number of nan column wise.
df_4.isnull().sum()

A    0
B    0
C    0
D    0
E    2
dtype: int64

In [30]:
#to remove the nulls
print(df_4.dropna()) 

#df_4 = df_4.dropna()  ##drop the null values and saves it to the same
#df_4.dropna(inplace=True)

df_4

                   A         B         C         D    E
2020-06-22  0.521826 -0.999455  0.432607  0.993062  0.7
2020-06-29  3.023598 -0.598091  0.194947  0.530921  1.6

                   A         B         C         D    E
2020-06-22  0.521826 -0.999455  0.432607  0.993062  0.7
2020-06-29  3.023598 -0.598091  0.194947  0.530921  1.6
2020-07-06 -0.872198 -2.112685 -0.684992 -0.677001  NaN
2020-07-13  0.694188 -1.215368 -0.137225 -0.023338  NaN

In [31]:
#backup/copy of the dataframe
df4_copy = df_4.copy()

In [32]:
#replacing the actual value with nulls for an experiment
df4_copy.iloc[3,0]=np.nan
df4_copy

                   A         B         C         D    E
2020-06-22  0.521826 -0.999455  0.432607  0.993062  0.7
2020-06-29  3.023598 -0.598091  0.194947  0.530921  1.6
2020-07-06 -0.872198 -2.112685 -0.684992 -0.677001  NaN
2020-07-13       NaN -1.215368 -0.137225 -0.023338  NaN

In [33]:
#checking for nulls
pd.isna(df4_copy)

                A      B      C      D      E
2020-06-22  False  False  False  False  False
2020-06-29  False  False  False  False  False
2020-07-06  False  False  False  False   True
2020-07-13   True  False  False  False   True

In [34]:
#replacing all null values 
df4_copy.fillna(value=2.0,inplace=True)
df4_copy

                   A         B         C         D    E
2020-06-22  0.521826 -0.999455  0.432607  0.993062  0.7
2020-06-29  3.023598 -0.598091  0.194947  0.530921  1.6
2020-07-06 -0.872198 -2.112685 -0.684992 -0.677001  2.0
2020-07-13  2.000000 -1.215368 -0.137225 -0.023338  2.0

In [35]:
#both these functions are same #df_4.isnull() or pd.isnull(df_4)
pd.isnull(df_4)

                A      B      C      D      E
2020-06-22  False  False  False  False  False
2020-06-29  False  False  False  False  False
2020-07-06  False  False  False  False   True
2020-07-13  False  False  False  False   True

In [36]:
#printing 
df_4

                   A         B         C         D    E
2020-06-22  0.521826 -0.999455  0.432607  0.993062  0.7
2020-06-29  3.023598 -0.598091  0.194947  0.530921  1.6
2020-07-06 -0.872198 -2.112685 -0.684992 -0.677001  NaN
2020-07-13  0.694188 -1.215368 -0.137225 -0.023338  NaN

In [37]:
#replacing the missing values of column E with the average/mean 
df_4.loc[pd.isnull(df_4['E']),['E']] = df_4['E'].mean()
df_4

                   A         B         C         D     E
2020-06-22  0.521826 -0.999455  0.432607  0.993062  0.70
2020-06-29  3.023598 -0.598091  0.194947  0.530921  1.60
2020-07-06 -0.872198 -2.112685 -0.684992 -0.677001  1.15
2020-07-13  0.694188 -1.215368 -0.137225 -0.023338  1.15

### Pandas Merging Operations
#### Concat and Join

In [38]:
#creating two small dataframe to concat
df_m1 = df2[0:5]
df_m2 = df2[6:10]
df_m3 = df2[11:16]

In [39]:
print(df_m1,"\n",df_m2,'\n',df_m3)

             A   B   C   D
2020-06-22   6  42   9  35
2020-06-29  32  12  30  36
2020-07-06  10  16  30  15
2020-07-13   8  32  20  36
2020-07-20  37   3   3  19
              A   B   C   D
2020-08-03  21   7   5  21
2020-08-10  43   6  33  17
2020-08-17  31  25   1  34
2020-08-24   5  29   4   7
              A   B   C   D
2020-09-07  13   2  25  25
2020-09-14   3  43   1  32
2020-09-21  12  12  23  21
2020-09-28   4  16  16  41

In [40]:
#concatination of two DataFrame
concat0 = pd.concat([df_m1,df_m2,df_m3])
concat0

             A   B   C   D
2020-06-22   6  42   9  35
2020-06-29  32  12  30  36
2020-07-06  10  16  30  15
2020-07-13   8  32  20  36
2020-07-20  37   3   3  19
2020-08-03  21   7   5  21
2020-08-10  43   6  33  17
2020-08-17  31  25   1  34
2020-08-24   5  29   4   7
2020-09-07  13   2  25  25
2020-09-14   3  43   1  32
2020-09-21  12  12  23  21
2020-09-28   4  16  16  41

In [41]:
concat1 =pd.concat([df_m1,df_m2,df_m3],keys=['m1','m2','m3'])
concat1

                A   B   C   D
m1 2020-06-22   6  42   9  35
   2020-06-29  32  12  30  36
   2020-07-06  10  16  30  15
   2020-07-13   8  32  20  36
   2020-07-20  37   3   3  19
m2 2020-08-03  21   7   5  21
   2020-08-10  43   6  33  17
   2020-08-17  31  25   1  34
   2020-08-24   5  29   4   7
m3 2020-09-07  13   2  25  25
   2020-09-14   3  43   1  32
   2020-09-21  12  12  23  21
   2020-09-28   4  16  16  41

In [42]:
concat1.loc['m3']

             A   B   C   D
2020-09-07  13   2  25  25
2020-09-14   3  43   1  32
2020-09-21  12  12  23  21
2020-09-28   4  16  16  41

In [43]:
#alternative method to merge data vertically
df_m3.append([df_m1,df_m2],sort=True)

             A   B   C   D
2020-09-07  13   2  25  25
2020-09-14   3  43   1  32
2020-09-21  12  12  23  21
2020-09-28   4  16  16  41
2020-06-22   6  42   9  35
2020-06-29  32  12  30  36
2020-07-06  10  16  30  15
2020-07-13   8  32  20  36
2020-07-20  37   3   3  19
2020-08-03  21   7   5  21
2020-08-10  43   6  33  17
2020-08-17  31  25   1  34
2020-08-24   5  29   4   7

In [44]:
#creating data frame

In [45]:
DF_M1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
'B': ['B0', 'B1', 'B2', 'B3'],
'C': ['C0', 'C1', 'C2', 'C3'],
'D': ['D0', 'D1', 'D2', 'D3']},
index=[0, 1, 2, 3])


DF_M2 = pd.DataFrame({'B': ['B2', 'B3', 'B6', 'B7'],
'D': ['D2', 'D3', 'D6', 'D7'],
'F': ['F2', 'F3', 'F6', 'F7']},
index=[2, 3, 6, 7])


print(DF_M1,"\n",DF_M2)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
     B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [46]:
#horizontal concat
concat2 = pd.concat([DF_M1, DF_M2], axis=1, sort=False)
#concat2 = pd.concat([DF_M1, DF_M2], axis=1)
concat2

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [47]:
DF_M1.append(DF_M2)

C:\MyDataScience\Anaconda\lib\site-packages\pandas\core\frame.py:7123: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
2  NaN  B2  NaN  D2   F2
3  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [48]:
DF_M1.append(DF_M2,ignore_index=True,sort=True)

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

#### Join

In [58]:
Join_1= pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],
'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})

Join_2 = pd.DataFrame({'key': ['K0', 'K1', 'K2','D1'],
'B': ['B0', 'B1', 'B2','D1']})

print(Join_1,"\n",Join_2)

  key   A
0  K0  A0
1  K1  A1
2  K2  A2
3  K3  A3
4  K4  A4
5  K5  A5
   key   B
0  K0  B0
1  K1  B1
2  K2  B2
3  D1  D1

In [59]:
#joining two tables. by default left join
Join_1.join(Join_2, lsuffix='_J1', rsuffix='_J2')

  key_J1   A key_J2    B
0     K0  A0     K0   B0
1     K1  A1     K1   B1
2     K2  A2     K2   B2
3     K3  A3     D1   D1
4     K4  A4    NaN  NaN
5     K5  A5    NaN  NaN

In [60]:
#Inner Join
Join_1.join(Join_2, lsuffix='_J1', rsuffix='_J2',how='inner')

  key_J1   A key_J2   B
0     K0  A0     K0  B0
1     K1  A1     K1  B1
2     K2  A2     K2  B2
3     K3  A3     D1  D1

In [61]:
#outer
Join_1.join(Join_2, lsuffix='_J1', rsuffix='_J2',how='outer')

  key_J1   A key_J2    B
0     K0  A0     K0   B0
1     K1  A1     K1   B1
2     K2  A2     K2   B2
3     K3  A3     D1   D1
4     K4  A4    NaN  NaN
5     K5  A5    NaN  NaN

In [62]:
#Right
Join_1.join(Join_2, lsuffix='_J1', rsuffix='_J2',how='right')

  key_J1   A key_J2   B
0     K0  A0     K0  B0
1     K1  A1     K1  B1
2     K2  A2     K2  B2
3     K3  A3     D1  D1

how{left, right, outer, inner}, default left
How to handle the operation of the two objects.

left: use calling frames index (or column if on is specified)

right: use others index.

outer: form union of calling frames index (or column if on is specified) with others index, and sort it. lexicographically.

inner: form intersection of calling frames index (or column if on is specified) with others index, preserving the order of the callings one.